xs2a-connector/src/test/resources/json/mappers/payment-to-spi-periodic-payment.json

{
  "paymentId": "yc7AU-GdRIMjLAzKXjmDU4",
  "paymentType": "SINGLE",
  "paymentProduct": "sepa-credit-transfers",
  "debtorAccount": {
    "iban": "DE52500105173911841934",
    "bban": "Test BBAN",
    "pan": "1111",
    "maskedPan": "23456xxxxxx1234",
    "msisdn": "0172/1111111",
    "currency": "EUR"
  },
  "debtorName": "Mueller",
  "transactionStatus" : "ACSC",
  "requestedExecutionDate" : "2020-12-12",
  "requestedExecutionTime": "12:00:00",
  "startDate": "2018-12-12",
  "endDate": "2018-12-28",
  "executionRule": "following",
  "frequency": "DAILY",
  "dayOfExecution": 1,
  "targets": [
    {
      "paymentId": "yc7AU-GdRIMjLAzKXjmDU4",
      "endToEndIdentification": "RI-123456789",
      "instructedAmount": {
        "currency": "EUR",
        "amount": 1000.0
      },
      "creditorAccount": {
        "iban": "DE52500105173911841934",
        "bban": "Test BBAN",
        "pan": "1111",
        "maskedPan": "23456xxxxxx1234",
        "msisdn": "0172/1111111",
        "currency": "EUR"
      },
      "creditorAgent": "BCENECEQ",
      "creditorName": "Telekom",
      "creditorAddress": {
        "street": "WBG Straße",
        "buildingNumber": "56",
        "city": "Nürnberg",
        "postalCode": "90543",
        "country": "DE"
      },
      "purposeCode": "BKDF",
      "remittanceInformationUnstructured": "Ref. Number TELEKOM-1222",
      "remittanceInformationStructured": {
        "reference": "Ref Number Merchant"
      }
    }
  ]
}